recall-exp-api/target/test-classes/scaffolder/request/sendRecallVechicleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeRecallInterface_v1">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:sendRecall>
         <!--Optional:-->
        
         <inc:recallVehicles>
            <inc:BusinessId>Trivett Australia</inc:BusinessId>
            <inc:ExternalId>sudhir-26-26</inc:ExternalId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
            <inc:CampaignNumber>kuna-05</inc:CampaignNumber>
            <inc:VIN>00020</inc:VIN>
             <inc:ClaimDate>2006-05-13</inc:ClaimDate>
            <inc:ClaimNumber>2384732897</inc:ClaimNumber> 
            <inc:RecallStatus>Not Required</inc:RecallStatus>
         </inc:recallVehicles>
      </inc:sendRecall>
   </soapenv:Body>
</soapenv:Envelope>