recall-exp-api/target/test-classes/scaffolder/request/sendRecallSoapfaultRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeRecallInterface_v1">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:sendRecall>
         <!--Optional:-->
         <inc:Recall>
            
            <inc:ExternalId>sudhir-26-26</inc:ExternalId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
            <inc:ExternalRecallId>12453</inc:ExternalRecallId>
            <inc:CampaignNumber>kuna-05</inc:CampaignNumber>
            <inc:RecallName>abc</inc:RecallName>
            <inc:RecallDescription>Recalling Vehicle in Full</inc:RecallDescription>
             <inc:StartDate>2005-04-20</inc:StartDate>
            <inc:EndDate>2006-05-20</inc:EndDate> 
         </inc:Recall>
         <inc:recallVehicles>
            <inc:BusinessId>Trivett Australia</inc:BusinessId>
            <inc:ExternalId>sudhir-26-26</inc:ExternalId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
            <inc:CampaignNumber>kuna-05</inc:CampaignNumber>
            <inc:VIN>00020</inc:VIN>
             <inc:ClaimDate>2006-05-13</inc:ClaimDate>
            <inc:ClaimNumber>2384732897</inc:ClaimNumber> 
            <inc:RecallStatus>Not Required</inc:RecallStatus>
         </inc:recallVehicles>
      </inc:sendRecall>
   </soapenv:Body>
</soapenv:Envelope>