recall-exp-api/target/test-classes/scaffolder/request/sendRecallErrorRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeRecallInterface_v1">
   <soapenv:Header>
      <inc:AllowFieldTruncationHeader>
         <inc:allowFieldTruncation>Y</inc:allowFieldTruncation>
      </inc:AllowFieldTruncationHeader>
      <inc:DebuggingHeader>
         <inc:categories>
            <inc:category>info</inc:category>
            <inc:level>4</inc:level>
         </inc:categories>
         <inc:debugLevel>INFO</inc:debugLevel>
      </inc:DebuggingHeader>
      <inc:CallOptions>
         <inc:client>inchcape</inc:client>
      </inc:CallOptions>
      <inc:SessionHeader>
         <inc:sessionId>111abc</inc:sessionId>
      </inc:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <inc:sendRecall>
         <inc:Recall>
            <inc:fieldsToNull>6</inc:fieldsToNull>
            <inc:Id>822020</inc:Id>
            <inc:BusinessId></inc:BusinessId>
            <inc:ExternalId></inc:ExternalId>
            <inc:SourceSystem>vanity</inc:SourceSystem>
            <inc:ExternalRecallId>45454</inc:ExternalRecallId>
            <inc:CampaignNumber>4576565</inc:CampaignNumber>
            <inc:RecallName>abc</inc:RecallName>
            <inc:RecallDescription>recall abc</inc:RecallDescription>
            <inc:StartDate>19/09/17</inc:StartDate>
            <inc:EndDate>19/09/17</inc:EndDate>
         </inc:Recall>
         <inc:recallVehicles>
            <inc:fieldsToNull>5</inc:fieldsToNull>
            <inc:Id>112305</inc:Id>
            <inc:BusinessId>33333</inc:BusinessId>
            <inc:ExternalId>22222</inc:ExternalId>
            <inc:SourceSystem>vanity</inc:SourceSystem>
            <inc:CampaignNumber>65653</inc:CampaignNumber>
            <inc:VIN>45546</inc:VIN>
            <inc:ClaimDate>19/09/17</inc:ClaimDate>
            <inc:ClaimNumber>abc123</inc:ClaimNumber>
            <inc:RecallStatus>pending</inc:RecallStatus>
         </inc:recallVehicles>
      </inc:sendRecall>
   </soapenv:Body>
</soapenv:Envelope>